app/controllers/weapons_controller.rb

  def index
    @weapons = Weapon.all
---
SELECT "weapons".* FROM "weapons"

  def create
    @weapon = Weapon.new(weapon_params)

    respond_to do |format|
      if @weapon.save
---
INSERT INTO "weapons" ("created_at", "damage", "image", "name", "note", "penetration", "price", "sound", "updated_at", "video_game", "weapon_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @weapon.update(weapon_params)
---
UPDATE "weapons" SET "image" = ?, "updated_at" = ? WHERE "weapons"."id" = 1  [["image", "http://vignette4.wikia.nocookie.net/cswikia/images/6/66/Ak47go.png"], ["updated_at", "2015-12-05 13:15:02.807479"]]

  def destroy
    @weapon.destroy
---
DELETE FROM "weapons" WHERE "weapons"."id" = ?  [["id", 1]]

    def set_weapon
      @weapon = Weapon.find(params[:id])
---
SELECT  "weapons".* FROM "weapons"  WHERE "weapons"."id" = ? LIMIT 1  [["id", 1]]